# 列表是有序的元素可以被修改，元组也是有序的但不能被修改

# 元组 tuple，元素不可被修改，并且元组不能被增加或删除
# li = [111, 222, 333, 44] # 列表
# tu = (111, 222, (11, 22, [1, 2, 3], 33), 333, 44,) # 一般写元组的时候，推荐最后加入逗号,

'''
tu = (111, 222, (11, 22, [1, 2, 3], 33), 333, 44,)
v = tu[0] # 索引
v1 = tu[1:5] # 切片
print(v)
print(v1)
'''

'''
tu = (111, 222, (11, 22, [1, 2, 3], 33), 333, 44,)
for item in tu: # 可以for循环，可迭代对象
    print(item)
'''

'''
# 转换
s = 'grgsgeg'
li = ['fdf', 5488]
tu = (12, 45, 'sasf')
v = tuple(s)
print(v)
v1 = tuple(li)
print(v1)
v2 = list(tu)
print(v2)
tu1 =['asf', 'gegd']
v3 = "_".join(tu1) # 只有元素都为字符串时
print(v3)
'''

'''
# 元组的一级元素不可修改/删除/增加
tu = (111, 'alex', (11, 22), [(33, 44)], True, 33, 44)
tu[3][0] = 567 # 元组中列表中的元素可以被修改
print(tu)
'''

'''
tu = (11, 22, 33, 44, 33,)
# count 获取指定元素在元组中出现的次数
v1 = tu.count(33)
# index
v2 = tu.index(33) # 获取指定元素在元组中第一次出现的位置
print(v1, v2)
'''
